Repository: davenorthcreek/stratum
Catalog: conf/translations/*/LC_MESSAGES/messages.po
Languages: sv_se

source: If all classes should be guarded with if(!class_exists) statements
sv_se: Om alla klasser ska skyddas med if(!class_exists) uttryck

source: If no type constructor should be generated
sv_se: Om ingen typkonstruktor ska genereras

source: If the output should be a single file
sv_se: Om utdata ska samlas i en fil

source: If the output to the console should be verbose
sv_se: Om uttryckligt läge skall användas

source: The input wsdl file
sv_se: Wsdl filen som skall parsas

source: The output directory or file if -s is used (in that case, .php will be appened to file name)
sv_se: Katalogen filerna sparas i. Om -s används blir detta filnamn och .php läggs till

source: Use namespace with the name
sv_se: Namnrymden alla klasser skall tillhöra

source: A comma separated list of classnames to generate. If this is used only classes that exist in the list will be generated. If the service is not in this list and the -s flag is used the filename will be the name of the first class that is generated
sv_se: En kommaseparerad lista med klassnamn som skall genereras. Om denna flagga anges kommer endast de klasser som finns i listan genereras. Om inte tjänsteklassen finns med i listan och flaggan -s används kommer filnamnet bli namnet av den första klassen som genereras

source: The prefix to use for the generated classes
sv_se: Prefix att använda för de genererade klasserna

source: The suffix to use for the generated classes
sv_se: Suffix att använda för de genererade klasserna

source: Adds the option to use single element arrays to the client
sv_se: Lägger till funktionen att använda single element arrays till klienten

source: Adds the option to use xsi arrays to the client
sv_se: Lägger till funktionen att använda xsi arrays till klienten

source: Adds the option to use wait one way calls to the client
sv_se: Lägger till funktionen att använda wait one way calls till klienten

source: Adds the option to not cache the wsdl to the client
sv_se: Lägger till funktionen att inte cacha wsdl filen till klienten

source: Adds the option to cache the wsdl on disk to the client
sv_se: Lägger till funktionen att cacha wsdl filen till disk till klienten

source: Adds the option to cache the wsdl in memory to the client
sv_se: Lägger till funktionen att cacha wsdl filen i minnet till klienten

source: Adds the option to cache the wsdl in memory and on disk to the client
sv_se: Lägger till funktionen att cacha wsdl filen både i minnet och på disk till klienten

source: Adds the option to compress the wsdl with gzip to the client
sv_se: Lägger till funktionen att komprimera wsdl filen med gzip till klienten

source: Adds the option to use share types
sv_se: Lägger till funktionen att använda dela typer

source: Show this help
sv_se: Visa denna hjälp

source: You have selected to only generate some of the classes in the wsdl(%s) and to save them in one file. Continue? [Y/n]
sv_se: Du har valt att endast generera några av klasserna i wsdlfilen(%s) och att spara dem i en fil. Fortsätt? [Y/n]

source: You have selected to only generate one class and save it to a single file. If you have selected the service class and outputs this file to a directory where you previosly have generated the classes the file will be overwritten. Continue? [Y/n]
sv_se: Du har valt att endast generera en klass och spara den i en fil. Om du har valt tjänsteklassen och sparar denna i samma utdatakatalog som du tidigare har genererat klasserna kommer filen skrivas över. Fortsätt? [Y/n]

source: Please select yes or no.
sv_se: Var vänlig välj yes eller no

source: Restriction pattern:
sv_se: Omfångsmönster:

source: Constant:
sv_se: Konstant:

source: Starting generation
sv_se: Startar generering

source: Generation complete
sv_se: Generering klar

source: Loading the wsdl
sv_se: Laddar wsdl filen

source: Loading the DOM
sv_se: Laddar DOM träd

source: Starting to load service
sv_se: Börjar ladda tjänst

source: Loading function
sv_se: Laddar funktion

source: Done loading service
sv_se: Klar med att ladda tjänst

source: Loading types
sv_se: Laddar typer

source: Loading type
sv_se: Laddar typ

source: Loading enum
sv_se: Laddar enumeration

source: Loading pattern
sv_se: Laddar mönster

source: Done loading types
sv_se: Klar med att ladda typer

source: Usage:
sv_se: Användning:

source: Help
sv_se: Hjälp

source: Required parameter missing!
sv_se: Nödvändig parameter saknas!

source: A flag that must have a parameter does not
sv_se: En flagga som måste ha en parameter saknar den
